docs/i2p.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>i2p</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="orgea30e3c">
<div class="navbar-brand" id="org1d49fa1">
<div class="navbar-item" id="orgfba2d57">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="org33ec0aa">
<div class="navbar-start" id="orgd47069e">
<div class="navbar-item" id="orgfb08838">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="orge6b963e">

</div>

</div>
</nav>
<div id="outline-container-org4827739" class="outline-2">
<h2 id="org4827739">i2p</h2>
<div class="outline-text-2" id="text-org4827739">
</div>
<div id="outline-container-orgd35fd2d" class="outline-3">
<h3 id="orgd35fd2d">notes</h3>
<div class="outline-text-3" id="text-orgd35fd2d">
<ul class="org-ul">
<li>server blinded keys are 56 chars instead of 52 and not viewable without the b33 address in flood fill routers</li>
<li>java and c++ implementations
<ul class="org-ul">
<li>both have apps on fdroid</li>
<li>browser bundle or proxy port</li>
</ul></li>
<li><a href="https://github.com/PurpleI2P/i2pd-tools/">https://github.com/PurpleI2P/i2pd-tools/</a>
<ul class="org-ul">
<li>generate blinded master signing key <code>keygen KeyName 11</code></li>
<li>sign server temp key <code>offlinekeys TempKeyName OfflineKey 11 365</code></li>
<li>output b33 for clients <code>keyinfo -b KeyName</code></li>
<li><code>x25519</code> util for base64 DH key for lease set auth</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orga98fda3" class="outline-4">
<h4 id="orga98fda3">router</h4>
<div class="outline-text-4" id="text-orga98fda3">
<div class="org-src-container">
<pre class="src src-conf">
## Default: ~/.i2pd/
#tunconf = /var/lib/i2pd/tunnels.conf
#tunnelsdir = /var/lib/i2pd/tunnels.d
#certsdir = /var/lib/i2pd/certificates

## Logs: stdout, file, syslog. stdout by default
#log = file
#logfile = /var/log/i2pd/i2pd.log
#pidfile = /run/i2pd.pid

#port = 4567
daemon = false
## Enable SSU (UDP) transport
ssu = true
## Bandwidth configuration
## L limit bandwidth to 32KBs/sec, O - to 256KBs/sec, P - to 2048KBs/sec, X - unlimited
bandwidth = O
## Max % of bandwidth limit for transit. 0-100. 100 by default
share = 50

## Enable communication through ipv4/6
ipv4 = true
ipv6 = true
[ssu2] ## Enable SSU2 transport
enabled = true
[sam] ## disable SAM Bridge (app control for bitcoin)
enabled = false
[socksproxy] ## disable SOCKS Proxy
enabled = false
[httpproxy] ## Enable HTTP Proxy for eep sites (4444)
enabled = true
[http] ## Enable Web Console (7070)
enabled = true
[ntcp2] ## Enable NTCP2 transport (TCP) (default = true)
enabled = true
[upnp] ## disable UPnP (enabled by default in WINDOWS, ANDROID)
enabled = false
[i2cp] ##  Enable I2CP protocol for torrent clients (7654)
enabled = true

[addressbook] ## Default: reg.i2p at "mainline" I2P Network. ex http://tracker2.postman.i2p http://tube.i2p http://get-monero.i2p
#defaulturl = http://shx5vqsw7usdaunyzr2qmes2fq37oumybpudrd4jjj4e4vk4uusa.b32.i2p/hosts.txt
#subscriptions = http://reg.i2p/hosts.txt,http://identiguy.i2p/hosts.txt,http://stats.i2p/cgi-bin/newhosts.txt,http://rus.i2p/hosts.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-org4e9a941" class="outline-4">
<h4 id="org4e9a941">tunnel configs</h4>
<div class="outline-text-4" id="text-org4e9a941">
<ul class="org-ul">
<li>wireguard server</li>
</ul>
<div class="org-src-container">
<pre class="src src-conf" id="orgd557ff4">[wg-simple-server]
type = udpserver # server
keys = wg.dat
host = 127.0.0.1
port = 1337
gzip = false # save cpu not trying to compress encypted wg data
#accesslist = ClientB32Address.b32.i2p,ClientB32Addr.b32.i2p
signaturetype = 11 # blinded
i2cp.leaseSetType = 5 # encypted lease set
#i2cp.leaseSetAuthType = 1 # DH Auth
#i2cp.leaseSetClient.dh.111 = phone:PublicKeyBase64Enc
#i2cp.leaseSetClient.dh.112 = laptop:PublicKeyBase64Enc
#i2cp.leaseSetClient.dh.113 = netbook:PublicKeyBase64Enc
#outbound.quantity = 5 # 16 max
#inbound.quantity = 5
outbound.length = 1 # 8 max
inbound.length = 1
</pre>
</div>
<div class="org-src-container">
<pre class="src src-conf" id="org45e94ef">[wg-simple-client]
type = udpclient
destination = ServerB33Address.b32.i2p
port = 1337
gzip = false # save cpu not trying to compress encypted wg data
matchtunnels = true # align tunnels for latency
i2cp.dontPublishLeaseSet = true
#i2cp.leaseSetPrivKey = PrivateBase64Enc
outbound.length = 1 # lower privacy with better speed
inbound.length = 1
</pre>
</div>
<div class="org-src-container">
<pre class="src src-text" id="org4b28556">dread.i2p=http://dreadtoobigdsrxg4yfspcyjr3k6675vftyco5pyb7wg4pr4dwjq.b32.i2p
z-lib.i2p=http://kkd7tiqf5lv3olqfdnkw4znmmmmnjo2xqlxrp5ntthp6juowaiha.b32.i2p
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>